{
  "api": {
    "titles": [
      "Зеленая миля",
      "Список Шиндлера",
      "Побег из Шоушенка",
      "Форрест Гамп",
      "Властелин колец: Возвращение короля",
      "Интерстеллар",
      "Криминальное чтиво",
      "Назад в будущее",
      "Темный рыцарь",
      "Унесённые призраками"
    ],
    "descriptions": [
      "Пол Эджкомб — начальник блока смертников в тюрьме «Холодная гора», каждый из узников которого однажды проходит «зеленую милю» по пути к месту казни. Пол повидал много заключённых и надзирателей за время работы. Однако гигант Джон Коффи, обвинённый в страшном преступлении, стал одним из самых необычных обитателей блока.",
      "Фильм рассказывает реальную историю загадочного Оскара Шиндлера, члена нацистской партии, преуспевающего фабриканта, спасшего во время Второй мировой войны почти 1200 евреев.",
      "Бухгалтер Энди Дюфрейн обвинён в убийстве собственной жены и её любовника. Оказавшись в тюрьме под названием Шоушенк, он сталкивается с жестокостью и беззаконием, царящими по обе стороны решётки. Каждый, кто попадает в эти стены, становится их рабом до конца жизни. Но Энди, обладающий живым умом и доброй душой, находит подход как к заключённым, так и к охранникам, добиваясь их особого к себе расположения.",
      "Сидя на автобусной остановке, Форрест Гамп — не очень умный, но добрый и открытый парень — рассказывает случайным встречным историю своей необыкновенной жизни. С самого малолетства парень страдал от заболевания ног, соседские мальчишки дразнили его, но в один прекрасный день Форрест открыл в себе невероятные способности к бегу. Подруга детства Дженни всегда его поддерживала и защищала, но вскоре дороги их разошлись.",
      "Повелитель сил тьмы Саурон направляет свою бесчисленную армию под стены Минас-Тирита, крепости Последней Надежды. Он предвкушает близкую победу, но именно это мешает ему заметить две крохотные фигурки — хоббитов, приближающихся к Роковой Горе, где им предстоит уничтожить Кольцо Всевластья.",
      "Когда засуха, пыльные бури и вымирание растений приводят человечество к продовольственному кризису, коллектив исследователей и учёных отправляется сквозь червоточину (которая предположительно соединяет области пространства-времени через большое расстояние) в путешествие, чтобы превзойти прежние ограничения для космических путешествий человека и найти планету с подходящими для человечества условиями.",
      "Когда засуха, пыльные бури и вымирание растений приводят человечество к продовольственному кризису, коллектив исследователей и учёных отправляется сквозь червоточину (которая предположительно соединяет области пространства-времени через большое расстояние) в путешествие, чтобы превзойти прежние ограничения для космических путешествий человека и найти планету с подходящими для человечества условиями.",
      "Подросток Марти с помощью машины времени, сооружённой его другом-профессором доком Брауном, попадает из 80-х в далекие 50-е. Там он встречается со своими будущими родителями, ещё подростками, и другом-профессором, совсем молодым.",
      "Бэтмен поднимает ставки в войне с криминалом. С помощью лейтенанта Джима Гордона и прокурора Харви Дента он намерен очистить улицы Готэма от преступности. Сотрудничество оказывается эффективным, но скоро они обнаружат себя посреди хаоса, развязанного восходящим криминальным гением, известным напуганным горожанам под именем Джокер.",
      "Тихиро с мамой и папой переезжает в новый дом. Заблудившись по дороге, они оказываются в странном пустынном городе, где их ждет великолепный пир. Родители с жадностью набрасываются на еду и к ужасу девочки превращаются в свиней, став пленниками злой колдуньи Юбабы. Теперь, оказавшись одна среди волшебных существ и загадочных видений, Тихиро должна придумать, как избавить своих родителей от чар коварной старухи."
    ],
    "genres": [
      "comedy",
      "crime",
      "documentary",
      "drama",
      "horror",
      "family",
      "romance",
      "scifi",
      "thriller"
    ],
    "previews": [
      "./video/preview-1.mpeg",
      "./video/preview-2.mpeg",
      "./video/preview-3.mpeg",
      "./video/preview-4.mpeg",
      "./video/preview-5.mpeg",
      "./video/preview-6.mpeg",
      "./video/preview-7.mpeg",
      "./video/preview-8.mpeg",
      "./video/preview-9.mpeg",
      "./video/preview-10.mpeg"
    ],
    "videos": [
      "./video/movie-1.mpeg",
      "./video/movie-2.mpeg",
      "./video/movie-3.mpeg",
      "./video/movie-4.mpeg",
      "./video/movie-5.mpeg",
      "./video/movie-6.mpeg",
      "./video/movie-7.mpeg",
      "./video/movie-8.mpeg",
      "./video/movie-9.mpeg",
      "./video/movie-10.mpeg"
    ],
    "actors": [
      "Хью Джекман",
      "Кристиан Бэйл",
      "Том Круз",
      "Леонардо Ди Каприо",
      "Брэд Питт",
      "Вин Дизель",
      "Дженнифер Лоуренс",
      "Вигго Мортенсен",
      "Дэниел Рэдклифф",
      "Орландо Блум",
      "Бен Аффлек",
      "Джейк Джилленхол",
      "Морган Фримен",
      "Джереми Реннер",
      "Иэн Маккеллен",
      "Джемма Артертон",
      "Анджелина Джоли",
      "Эмма Уотсон",
      "Джонни Депп",
      "Эмма Стоун"
    ],
    "directors": [
      "Стэнли Кубрик",
      "Ингмар Бергман",
      "Альфред Хичкок",
      "Акира Куросава",
      "Орсон Уэллс",
      "Federico Fellini",
      "Джон Форд",
      "Мартин Скорсезе"
    ],
    "userNames": [
      "Andrew",
      "Max",
      "Eva",
      "Ann",
      "Ben",
      "Frank",
      "Monika"
    ],
    "userEmails": [
      "Andrew@mail.com",
      "Max@mail.com",
      "Eva@mail.com",
      "Ann@mail.com",
      "Ben@mail.com",
      "Frank@mail.com",
      "Monika@mail.com"
    ],
    "userAvatars": [
      "./img/avatar-1.jpg",
      "./img/avatar-2.jpg",
      "./img/avatar-3.jpg",
      "./img/avatar-4.jpg",
      "./img/avatar-5.jpg",
      "./img/avatar-6.jpg",
      "./img/avatar-7.jpg"
    ],
    "posters": [
      "./img/poster-1.jpg",
      "./img/poster-2.jpg",
      "./img/poster-3.jpg",
      "./img/poster-4.jpg",
      "./img/poster-5.jpg",
      "./img/poster-6.jpg",
      "./img/poster-7.jpg",
      "./img/poster-8.jpg",
      "./img/poster-9.jpg",
      "./img/poster-10.jpg"
    ],
    "backgroundImages": [
      "./img/bg-image-1.jpg",
      "./img/bg-image-2.jpg",
      "./img/bg-image-3.jpg",
      "./img/bg-image-4.jpg",
      "./img/bg-image-5.jpg",
      "./img/bg-image-6.jpg",
      "./img/bg-image-7.jpg",
      "./img/bg-image-8.jpg",
      "./img/bg-image-9.jpg",
      "./img/bg-image-10.jpg"
    ],
    "colors": [
      "#b5c603",
      "#823108",
      "#182837",
      "#51c76d",
      "#fbe7b6",
      "#12b1c0",
      "#000000",
      "#ffffff"
    ]
  }
}
